---
kind: other
id: Methods.T:Autodesk.Revit.DB.MEPModel
source: html/9036fb24-a9bc-116b-e953-bf8c9cb08bee.htm
---
# MEPModel Methods

Causes the object to release immediately any resources it may be utilizing.